Autodesk.Revit.DB.Structure.StructuralSettings.BoundarySetbackDisabledForSteelElements
Disallow shortening (setbacks) to joined element boundaries for beams and braces. If enabled, then beams and braces will have the setbacks set to 0 by default.
Explicit setbacks to references will still be allowed.
Since:
2026